package timeago

func bgLocale(_ float64, index int) (ago string, in string) {
	var res = [][]string{
		{"току що", "съвсем скоро"},
		{"преди %d секунди", "след %d секунди"},
		{"преди 1 минута", "след 1 минута"},
		{"преди %d минути", "след %d минути"},
		{"преди 1 час", "след 1 час"},
		{"преди %d часа", "след %d часа"},
		{"преди 1 ден", "след 1 ден"},
		{"преди %d дни", "след %d дни"},
		{"преди 1 седмица", "след 1 седмица"},
		{"преди %d седмици", "след %d седмици"},
		{"преди 1 месец", "след 1 месец"},
		{"преди %d месеца", "след %d месеца"},
		{"преди 1 година", "след 1 година"},
		{"преди %d години", "след %d години"},
	}[index]
	return res[0], res[1]
}
