package timeago

func elLocale(_ float64, index int) (ago string, in string) {
	var res = [][]string{
		{"μόλις τώρα", "σε λίγο"},
		{"%d δευτερόλεπτα πριν", "σε %d δευτερόλεπτα"},
		{"1 λεπτό πριν", "σε 1 λεπτό"},
		{"%d λεπτά πριν", "σε %d λεπτά"},
		{"1 ώρα πριν", "σε 1 ώρα"},
		{"%d ώρες πριν", "σε %d ώρες"},
		{"1 μέρα πριν", "σε 1 μέρα"},
		{"%d μέρες πριν", "σε %d μέρες"},
		{"1 εβδομάδα πριν", "σε 1 εβδομάδα"},
		{"%d εβδομάδες πριν", "σε %d εβδομάδες"},
		{"1 μήνα πριν", "σε 1 μήνα"},
		{"%d μήνες πριν", "σε %d μήνες"},
		{"1 χρόνο πριν", "σε 1 χρόνο"},
		{"%d χρόνια πριν", "σε %d χρόνια"},
	}[index]
	return res[0], res[1]
}
