package timeago

func hiLocale(_ float64, index int) (ago string, in string) {
	var res = [][]string{
		{"अभी", "कुछ समय"},
		{"%d सेकंड पहले", "%d सेकंड में"},
		{"1 मिनट पहले", "1 मिनट में"},
		{"%d मिनट पहले", "%d मिनट में"},
		{"1 घंटे पहले", "1 घंटे में"},
		{"%d घंटे पहले", "%d घंटे में"},
		{"1 दिन पहले", "1 दिन में"},
		{"%d दिन पहले", "%d दिनों में"},
		{"1 सप्ताह पहले", "1 सप्ताह में"},
		{"%d हफ्ते पहले", "%d हफ्तों में"},
		{"1 महीने पहले", "1 महीने में"},
		{"%d महीने पहले", "%d महीनों में"},
		{"1 साल पहले", "1 साल में"},
		{"%d साल पहले", "%d साल में"},
	}[index]
	return res[0], res[1]
}
