package timeago

func mlLocale(_ float64, index int) (ago string, in string) {
	var res = [][]string{
		{"ഇപ്പോള്‍", "കുറച്ചു മുന്‍പ്"},
		{"%d സെക്കന്റ്‌കള്‍ക്ക് മുന്‍പ്", "%d സെക്കന്റില്‍"},
		{"1 മിനിറ്റിനു മുന്‍പ്", "1 മിനിറ്റില്‍"},
		{"%d മിനിറ്റുകള്‍ക്ക് മുന്‍പ", "%d മിനിറ്റില്‍"},
		{"1 മണിക്കൂറിനു മുന്‍പ്", "1 മണിക്കൂറില്‍"},
		{"%d മണിക്കൂറുകള്‍ക്കു മുന്‍പ്", "%d മണിക്കൂറില്‍"},
		{"1 ഒരു ദിവസം മുന്‍പ്", "1 ദിവസത്തില്‍"},
		{"%d ദിവസങ്ങള്‍ക് മുന്‍പ്", "%d ദിവസങ്ങള്‍ക്കുള്ളില്‍"},
		{"1 ആഴ്ച മുന്‍പ്", "1 ആഴ്ചയില്‍"},
		{"%d ആഴ്ചകള്‍ക്ക് മുന്‍പ്", "%d ആഴ്ചകള്‍ക്കുള്ളില്‍"},
		{"1 മാസത്തിനു മുന്‍പ്", "1 മാസത്തിനുള്ളില്‍"},
		{"%d മാസങ്ങള്‍ക്ക് മുന്‍പ്", "%d മാസങ്ങള്‍ക്കുള്ളില്‍"},
		{"1 വര്‍ഷത്തിനു  മുന്‍പ്", "1 വര്‍ഷത്തിനുള്ളില്‍"},
		{"%d വര്‍ഷങ്ങള്‍ക്കു മുന്‍പ്", "%d വര്‍ഷങ്ങള്‍ക്കുല്ല്ളില്‍"},
	}[index]
	return res[0], res[1]
}
