package timeago

func taLocale(_ float64, index int) (ago string, in string) {
	var res = [][]string{
		{"இப்போது", "சற்று நேரம் முன்பு"},
		{"%d நொடிக்கு முன்", "%d நொடிகளில்"},
		{"1 நிமிடத்திற்க்கு முன்", "1 நிமிடத்தில்"},
		{"%d நிமிடத்திற்க்கு முன்", "%d நிமிடங்களில்"},
		{"1 மணி நேரத்திற்கு முன்", "1 மணி நேரத்திற்குள்"},
		{"%d மணி நேரத்திற்கு முன்", "%d மணி நேரத்திற்குள்"},
		{"1 நாளுக்கு முன்", "1 நாளில்"},
		{"%d நாட்களுக்கு முன்", "%d நாட்களில்"},
		{"1 வாரத்திற்கு முன்", "1 வாரத்தில்"},
		{"%d வாரங்களுக்கு முன்", "%d வாரங்களில்"},
		{"1 மாதத்திற்கு முன்", "1 மாதத்தில்"},
		{"%d மாதங்களுக்கு முன்", "%d மாதங்களில்"},
		{"1 வருடத்திற்கு முன்", "1 வருடத்தில்"},
		{"%d வருடங்களுக்கு முன்", "%d வருடங்களில்"},
	}[index]
	return res[0], res[1]
}
